
[
    "Use the reaction buttons at the bottom of this menu to get more information on each topic:",
    {
        "EMOJI": "🛑",
        "ENTRY": "__Game hosting etiquette__",
        "INFO": "**1.** Always remember to delete a game after it's finished or once you don't plan on continuing it; server memory is not free.\n\n**2.** Hosting a private game for you and your friends is completely fine. That said, we encourage you to try to be inclusive and ask around if anyone wants to join."
    },
    {
        "EMOJI": "💭",
        "ENTRY": "How do I create a Dominions 5 game?",
        "INFO": "To host a Dominions 5 game, follow the steps below:\n\n**1.** Use the `/capacity` command to check the available servers and how many free slots each has.\n\n**2.** Use the `/host` command, followed by the name of the server on which you want to host your game, i.e. `/host nataraj`. Servers are largely equivalent, so the only criterion to determine which one to pick should be the number of available slots.\n\n**3.** You will have received a DM from the bot. Simply answer its questions in the DM to determine the settings of your game.\n\n**4.** Once all answers are provided, the bot will send you a breakdown of your settings. It will also have created a channel with your game name in the corresponding category in the Discord guild on which you used the original `/host` command, as well as a role for the players of the game. At this point, you can also connect to your game through the Dominions client using the provided IP and port.\n\n**5.** Players can assign themselves the game's role by using the `/subscribe` command. Claiming a pretender should also automatically assign the role to the player.\n\n**6.** When pretenders are ready, simply use the `/start` command in your game's channel, and the bot will start the game. Note that generating the game can take a significant amount of time, depending on the map size and players and how busy the server is (close to an hour, in the worst cases), so give it time."
    },
    {
        "EMOJI": "✅",
        "ENTRY": "How do I claim a pretender I have submitted?",
        "INFO": "After submitting a pretender in-game, follow the steps below:\n\n**1.** In the game's channel, type the `/pretenders` command. This will display a list of the currently submitted pretenders, as well as their nation number.\n\n**2.** Type in the `/claim` command followed by your pretender's nation number, i.e. `/claim 50`.\n\n**3.** You're done! Note that claiming a pretender is no longer a requirement to start a game, and doing so simply provides access to some advanced functionality like player preferences which allow one to receive backups of new turns, turn reminders, etc."
    },
    {
        "EMOJI": "❌",
        "ENTRY": "How do I remove a pretender I have submitted?",
        "INFO": "After submitting a pretender in-game, follow the steps below:\n\n**1.** In the game's channel, type the `/pretenders` command. This will display a list of the currently submitted pretenders, as well as their nation number.\n\n**2.** Type in the `/remove` command followed by your pretender's nation number, i.e. `/remove 50`.\n\n**3.** You're done! Note that you can only remove your own pretender, unless you are the organizer of a game."
    },
    {
        "EMOJI": "⚡",
        "ENTRY": "How do I create a Dominions 5 blitz?",
        "INFO": "A blitz is a Dominions 5 game that is meant to be more compact and resolved in one sitting. As such, it normally has no turn timer (or a short timer, like 10 minutes), and things like new turn notifications are not needed. The process to host a blitz is exactly the same as that of hosting a regular game. Simply tweak the settings to your liking."
    },
    {
        "EMOJI": "🌟",
        "ENTRY": "Where can I find the list of commands?",
        "INFO": "A list of all commands can be found in the `#clockwork_help` channel within every Discord guild in which the bot has been deployed (unless the guild owner has deleted it)."
    },
    {
        "EMOJI": "🏗",
        "ENTRY": "I want to create a channel to discuss settings first, and then host a game. How can I do this?",
        "INFO": "To create a channel, you can use the `/channel` command in a guild, followed by a channel name (ideally your future game's name), i.e. `/channel mygamename`. Once a channel has been created in this fashion, the next game you host using the `/host` command will automatically be assigned to said channel.** Beware**, you can only have one channel created this way until you host a game, so make sure you finish the hosting process before using the channel command again."
    },
    {
        "EMOJI": "⬆",
        "ENTRY": "How do I upload a map or mod to a server to use in my game?",
        "INFO": "The first thing you should do is use the `/dom5maps` or `/dom5mods` commands, followed by the name of a server (i.e. `/dom5maps nataraj`) to make sure the map or mod is not already available in the server on which you are planning to host your game. If it isn't, then follow the steps below:\n\n**1.** Locate all the map or mod files in question on your computer, and compress them all into a single .zip file. Only the .zip format is accepted! Make sure you zip them up directly as they are contained in the `maps` or `mods` folder. *Do not* zip a folder containing the files.\n\n**2.** Upload that zipped file to your Google Drive.\n\n**3.** In Google Drive, right click your zipped file, and click on 'Get link'. Make sure the link is *public*.\n\n**4.** Copy your shareable link.\n\n**5.** On a Discord guild where the bot is deployed, type in the command `/upload`, followed by the type of content you are uploading (`map` or `mod`), the shareable link you copied, and the name of the server to which you are uploading your file. For example: `/upload map https://docs.google.com/document/d/18L1HdugEyVzYuWxx_J1x-lgI99KT8mbAX99F8o1B7M/edit?usp=sharing nataraj`\n\n**6.** The bot will start downloading your file and will notify you when it's finished. Note that already existing files will *not* be overwritten, so as to prevent an upload causing problems to an ongoing game, and you will receive an error if a `.map` or `.dm` file already exists on the server."
    }
]